[
    {
    "id": 1,
    "name": "React"
    ,"summary" : "React is my framework of choice in all my web projects, i started using it in 2019 and still use and learn new things about it."

    },
    {
    "id": 2,
    "name": "NodeJS"
    ,"summary" : "NodeJS is just magnificent, i have used node extensively in my personal reaspberypi projects and projects during college, like using node as a PLC in solar plant monitoring app."
    },
    {
    "id": 3,
    "name": "JavaScript"
    ,"summary" : "javascript is my first high level language and one of the greatest languages i learned."
    },
    {
    "id": 4,
    "name": "C++"
    ,"summary" : "my language of choice for console application and personal projects, like my chess app check my github."
    },
    {
    "id": 5,
    "name": "HTML5"
    ,"summary" : "html and css is my bread and butter, i use them almost everyday and am completely fluent."
    },
    {
    "id": 6,
    "name": "CSS3"
    ,"summary" : "like html , css is my bread and butter, i'm completely fluent in CSS3."
    
    },
    {
    "id": 7,
    "name": "Azure"
    ,"summary" : "I've used azure to host domains before made VMs and domain controllers, i have completed Azure AZ900 course and assessment."
    },
    {
    "id": 8,
    "name": "Bootstrap"
    ,"summary" : "Bootstrap made my life easy as a beginner, but still somtimes its handiy for a quick modal."
    },
    {
    "id": 9,
    "name": "Axios"
    ,"summary" : "i have used axius in this project to fetch request from apis(which i will publish soon)"
    },
    {
    "id": 10,
    "name": "MongoDB"
    ,"summary" : "MongoDB was initially used in this project too, i have used mongoDB and other databases in my project."
    },
    {
    "id": 11,
    "name": "Nothing for now"
    ,"summary" : "but don't worry, I'm constantly learning. This will be filled soon by Docker, Rest api... I will add them when i'm confident in my skills in them."
    },
    {
    "id": 12,
    "name": "Nothing for now"
    ,"summary" : "but don't worry, I'm constantly learning. This will be filled soon by Docker, Rest api... I will add them when i'm confident in my skills in them."
    }



]